#include <stdio.h>
/*
Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден
негативен број или 0 треба да се печати „Invalid input“.
Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се
наоѓаат на парните позиции од другиот број, во истиот редослед. Соодветно да се
испечатат пораки „PAREN“ и „NE“.
Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)
*/
int br(int a, int b)
{
    int temp;
    if (a > b)
    {
        temp = b;
        while (temp)
            if (temp % 10 == (a / 10) % 10)
            {
                temp /= 10;
                a /= 100;
            }
            else
                return 1;
    }
    else
    {
        temp = a;
        while (temp)
            if (temp % 10 == (b / 10) % 10)
            {
                temp /= 10;
                b /= 100;
            }
            else
                return 1;
    }
    return 0;
}
int main()
{
    int a, b;
    scanf("%d %d", &a, &b);
    if (a <= 0 || b <= 0)
    {
        printf("Invalid input");
        return 0;
    }
    if (br(a, b) == 1)
        printf("NE");
    else if (br(a, b) == 0)
        printf("PAREN");
}
