#include <stdio.h>
/*
Од стандарден влез се читаат непознат број на хексадецимални цифри се додека
не се внесе точка (.). Ваша задача е да го пресметате декадниот збир на внесените
хексадецимални цифри. Доколку добиениот декаден збир е делив со 16 се печати
Pogodok. Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16
(последните цифри му се 1 и 6), се печати Poln pogodok инаку се печати самиот збир.
*/
int main()
{
    char c;
    int zbir = 0;
    while (1)
    {
        scanf("%c", &c);
        if (c == '.')
            break;
        if ((c >= '0') && (c <= '9'))
        {
            zbir += c - '0';
        }
        if ((c >= 'a') && (c <= 'f'))
        {
            zbir += c - 'a' + 10;
        }
        if ((c >= 'A') && (c <= 'F'))
        {
            zbir += c - 'A' + 10;
        }
    }
    if ((zbir % 16) == 0)
    {
        if (zbir % 100 == 16)
            printf("Poln pogodok");
        else
            printf("Pogodok");
    }
    else
        printf("%d", zbir);
}