#include <stdio.h>
/*
Да се имплементира рекурзивна функција која за низа од цели броеви
$[a{0}, a{1}, ..., a_{n-1}]$ ќе ја пресмета вредноста на непрекинатата дропка
дефинирана како:

v=a0+1/a1+...1/an−2+1/an−1

Да се напише програма во која се чита цел број N, по што се читаат елементите на
низа од N цели броеви (не повеќе од 100). Потоа се повикува рекурзивната функција
и се печати резултатот во нов ред.
*/

double dropka(int n, int a[], int i)
{
    if (i == n - 1)
    {
        return a[n - 1];
    }
    return a[i] + (1 / dropka(n, a, i + 1));
}

int main()
{
    int n, niza[100];
    scanf("%d", &n);
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &niza[i]);
    }
    printf("%lf", dropka(n, niza, 0));
}