#include <stdio.h>
#include <ctype.h>
#include <string.h>
/*
Од стаднарден влез се читаат N низи од знаци (стрингови) не подолги од 80 знаци.
На почетокот на програмата се читаат два цели броеви:
N - бројот на низи од знаци кои ќе се читаат и
X - поместување.
Секоја од вчитаните низи од знаци треба да се трансформира на тој начин што
секоја од малите и големите букви (a-z, A-Z) се заменува со истата буква
поместена X места понапред во азбуката (a-z). Ако се надмине опсегот на буквите
во азбуката, се продолжува циклично од почетокот на азбуката. Трансформираната
низа да се отпечати на СИ.
Трансформацијата да се имплементира со посебна рекурзивна функција.
*/
int pomestuvanje(char a[], int x, int i)
{
    int c;
    if (a[i] == '\0')
    {
        return 0;
    }
    if (isalpha(a[i]))
    {
        if (isupper(a[i]))
        {
            c = a[i] - 'A';
            c += x;
            a[i] = c % 26 + 'A';
        }
        if (islower(a[i]))
        {
            c = a[i] - 'a';
            c += x;
            a[i] = c % 26 + 'a';
        }
    }
    return pomestuvanje(a, x, i + 1);
}

int main()
{
    int n, x, p;
    scanf("%d%d\n", &n, &x);
    for (int i = 0; i <= n; i++)
    {
        char a[80] = {0};
        fgets(a, 80, stdin);
        a[strlen(a) - 1] = '\0';
        pomestuvanje(a, x, 0);
        printf("%s", a);
        printf("\n");
    }

    return 0;
}