#include <stdio.h>
/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата).
Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант
(-5 во примерот на сликата).
Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100).
Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез.
Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за
четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант
треба да се испечати 0.
*/
int main()
{
    int n, m, a[100][100], r, k, kv[4] = {0};
    scanf("%d %d", &n, &m);
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
            scanf("%d", &a[i][j]);
    }
    scanf("%d %d", &r, &k);

    for (int i = 0; i < r; i++)
    {
        // kv1
        for (int j = k; j < m; j++)
            kv[0] += a[i][j];
        // kv2
        for (int j = 0; j < k; j++)
            kv[1] += a[i][j];
    }
    for (int i = r; i < n; i++)
    {
        // kv3
        for (int j = 0; j < k; j++)
            kv[2] += a[i][j];
        // kv4
        for (int j = k; j < m; j++)
            kv[3] += a[i][j];
    }
    for (int i = 0; i < 4; i++)
        printf("%d ", kv[i]);

    return 0;
}