#include <stdio.h>
/*
Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.
Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе
нешто што не е број. За секој од нив да се испечати максималната цифра во посебен ред.
Забелешка: Решението со рекурзивна функција носи 100% од поените, а со
нерекурзивна функција 70% од поените.
Забелешка: ЗАБРАНЕТО е користење на глобални променливи.
*/
void maksBr(int n, int *maks)
{
    if (!n)
    {
        printf("%d\n", *maks);
        return;
    }
    if (n % 10 > *maks)
    {
        *maks = n % 10;
        maksBr(n / 10, maks);
    }
    else
        maksBr(n / 10, maks);
}
int main()
{
    int maks = 0, br;
    while (scanf("%d", &br))
    {
        maksBr(br, &maks);
        maks = 0;
    }
}