#include <stdio.h>
/*
Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа
се внесува и цел број ind (ind >= 0).
Да се напише функција sum_pos која ја прима низата, бројот ind
(кој претставува индекс во низата) и бројот на валидни елементи во низата.
Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс
ind па се до крајот на низата. Ако индексот ind е поголем од Nфункцијата треба да врати 0.
НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).
*/
int sum_pos(int *niza, int ind, int n)
{
    int suma = 0;
    if (ind > n)
    {
        return 0;
    }
    for (int i = ind; i < n; ++i)
    {
        suma += *(niza + i);
    }
    return suma;
}
int main()
{
    int n;
    scanf("%d", &n);
    int niza[n], ind;
    for (int i = 0; i < n; ++i)
    {
        scanf("%d", (niza + i));
    }
    scanf("%d", &ind);
    printf("%d", sum_pos(niza, ind, n));
}